Tekla Open API Reference for Tekla Structures 2025
ProfileItem.NumberOfCrossSections Property
 The number of cross sections in the profile item.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int NumberOfCrossSections { get; }
Public ReadOnly Property NumberOfCrossSections As Integer
	Get
Property Value
Type: Int32
See Also
Reference
ProfileItem Class
Tekla.Structures.Catalogs Namespace